In [6]:
import pandas as pd

ebola = pd.read_csv('../data/country_timeseries.csv')
ebola.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN

In [ ]:
ebola.fillna(0)

In [ ]:
ebola.fillna(method = 'ffill')

In [ ]:
ebola.fillna(method = 'bfill')

In [ ]:
(2769 + 2730) / 2

In [ ]:
ebola['Cases_Guinea'].astype(int)

In [ ]:
ebola.dropna(axis = 0)  # [0, 1, 2, 4, ]

In [ ]:
ebola.dropna(axis = 1)

In [ ]:
ebola_fill = ebola.fillna(method = 'bfill').fillna(0)

In [ ]:
ebola_fill.info()

### 누락값 처리 문제

In [ ]:
df = pd.read_csv('data/pandas/basic1.csv')
df.head()

In [ ]:
df.info()

#### 1번
* 첫번째 데이터 부터 순서대로 50:50으로 데이터를 나누고, 앞에서 부터 50%의 데이터(이하, A그룹)는 'f1'컬럼의 결측치를 A그룹의 중앙값으로 채우고, 뒤에서부터 50% 데이터(이하, B그룹)는 'f1'컬럼의 결측치를 B그룹의 최대값으로 채운 후, A그룹과 B그룹의 표준편차 합을 구하시오. (소수점 첫째자리)

In [ ]:
# step1
# 순서대로 50:50으로 데이터를 나누고
# 앞에서 부터 50%의 데이터(이하, A그룹), 뒤에서부터 50% 데이터(이하, B그룹)\
A = df.iloc[:50]
B = df.iloc[50:]
print(A.shape, B.shape)

In [ ]:
# step2
# A그룹은 누락값을 A그룹의 중앙값 (f1컬럼 대상)
# B그룹은 누락값을 B그룹의 최대값 (f1컬럼 대상)
A_median = A['f1'].median()
B_max = B['f1'].max()

A_fill = A['f1'].fillna(A_median)
B_fill = B['f1'].fillna(B_max)
print(A_fill.count(), B_fill.count())

In [ ]:
# step3
# A그룹과 B그룹의 표준편차 합 (소수점 첫째자리)
std_sum = A_fill.std() + B_fill.std()
round(std_sum, 1)

#### 2번
* 'f4'컬럼 기준 내림차순 정렬과 'f5'컬럼 기준 오름차순 정렬을 순서대로 다중 조건 정렬하고나서 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값을 찾고, 이 최소값으로 앞에서 부터 10개의 'f5'컬럼 데이터를 변경함. 그리고 'f5'컬럼의 평균값을 계산함. (단 소수점 둘째자리까지 출력(셋째자리에서 반올림))

In [ ]:
# 'f4'컬럼 기준 내림차순 정렬과 'f5'컬럼 기준 오름차순 정렬
sorted_df = df.sort_values(['f4', 'f5'], ascending=[False, True])
sorted_df

In [ ]:
items = [1,2,3]
items2 = items.copy()
print(items)
print(items2)

items2.pop()
print(items2)
print(items)

In [ ]:
# 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값 [1,2,3,4,5,6,7,8,9,10]
# 앞에서 부터 10개의 'f5'컬럼 데이터를 변경     [1,1,1,1,1,1,1,1,1,1]

min_value = sorted_df.iloc[:10, -1].min()

# df를 복사하는 방법
sorted_df2 = sorted_df.copy()

sorted_df2.iloc[:10, -1] = min_value

In [ ]:
# 'f5'컬럼의 평균값 (소수점 둘째)

round(sorted_df2['f5'].mean(), 2)

In [ ]:
def my_sq(x):
    return x ** 2 

def my_exp(x, n):
    return x ** n

In [ ]:
import pandas as pd

df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]})
df

In [ ]:
sq = df['a'].apply(my_sq)
print(sq)

In [ ]:
df['a'] : Series  >>  10, 20, 30  >>   my_sq(10), my_sq(20), my_sq(30)  
>> 100, 400, 900  >> new Series

In [ ]:
df['a'].apply(my_exp, n=2)

In [ ]:
def plus10(x):
    return x + 10

lambda x : x + 10

In [ ]:
df['a'].apply(lambda x : x ** 2)

In [ ]:
df['a'].apply(lambda x, n : x ** n, n = 2)

In [7]:
df = pd.read_csv('../data/basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [ ]:
def mbti(x):
    return x[0]

lambda x : x[0]

In [ ]:
df['mbti1'] =  df['f4'].apply(mbti)
df

In [ ]:
df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]})
df

In [ ]:
def print_me(x):
    print(x)

In [ ]:
df.apply(print_me, axis = 1)

In [ ]:
print_me(df['a'])    # df['b']

In [ ]:
a = print()
print(a)

In [8]:
exam = pd.read_csv('../data/exam.csv')
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [ ]:
exam['math'].apply(lambda x : x // 10)

In [ ]:
exam['math']  //  10

In [ ]:
exam['total']  = exam['math'] + exam['english'] + exam['science']
exam

In [ ]:
# ebola
# pd.read_csv('country_timeseries.csv', parse_dates = ['Date'])
ebola['Date2'] = pd.to_datetime(ebola['Date'])
year = ebola['Date2'].dt.year
                    # '1/5/2015'
ebola['Date'].apply(lambda x : int(x[-4:])  )

# ebola[['Date', 'Date2']].head(3)

In [9]:
titanic = pd.read_csv('../data/titanic.csv')
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [10]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
def count_missing(vec):
    return vec.isnull().sum()

In [12]:
titanic.apply(   count_missing   , axis = 1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [13]:
def prop_missing(vec):
    # 누락값의 개수
    num = count_missing(vec)
    # 전체 로우(컬럼)의 개수
    length = vec.size
    return num / length

In [ ]:
titanic.apply(   prop_missing   , axis = 0)

In [14]:
import numpy as np
# male or female or etc
def convert(x):
    if x == 'male':
        return 0
    elif x == 'female':
        return 1
    else:
        return np.nan

In [15]:
titanic['Sex'] = titanic['Sex'].apply(convert)

In [16]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
avg_age = titanic['Age'].mean() # 177

In [18]:
titanic['Age'].fillna(avg_age)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [19]:
titanic['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [20]:
titanic['Cabin'].fillna('N').apply(lambda x : x[0])

0      N
1      C
2      N
3      C
4      N
      ..
886    N
887    B
888    N
889    C
890    N
Name: Cabin, Length: 891, dtype: object

In [ ]:
titanic['Cabin'].fillna('N').apply(lambda x : x[0]).unique()

In [ ]:
titanic[titanic['Embarked'].isnull()]

In [ ]:
titanic['Embarked'].value_counts()

In [ ]:
ebola